UNF_KlK.КИТ_ДОК/src/Documents/ОтчетПроизводстваЗаСменуЛСП/ОтчетПроизводстваЗаСменуЛСП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетПроизводстваЗаСменуЛСП</name>
  <registerRecords>InformationRegister.СостояниеПакета</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеПоПроизводству</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетПроизводстваУНФ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.СменыПроизводства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Выпуск</name>
    <attributes>
      <name>Пакет</name>
      <type>
        <types>CatalogRef.Пакеты</types>
      </type>
    </attributes>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Толщина</name>
      <type>
        <types>CatalogRef.Толщины</types>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>CatalogRef.Ширины</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДосок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратныеОтходы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сырье</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>CatalogRef.Ширины</types>
      </type>
    </attributes>
    <attributes>
      <name>Толщина</name>
      <type>
        <types>CatalogRef.Толщины</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДосок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДосок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладОтправитель</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Несертифицированный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UNF_KlK.КИТ_ДОК/src/InformationRegisters/СостояниеПакета/СостояниеПакета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеПакета</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПакетов</types>
    </type>
  </resources>
  <dimensions>
    <name>Пакет</name>
    <type>
      <types>CatalogRef.Пакеты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UNF_KlK.КИТ_ДОК/src/Enums/СостоянияПакетов/СостоянияПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияПакетов</name>
  <enumValues>
    <name>НеОприходован</name>
  </enumValues>
  <enumValues>
    <name>Оприходован</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
  </enumValues>
</mdclass:Enum>

UNF_KlK.КИТ_ДОК/src/Enums/ВидыРеквизита/ВидыРеквизита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРеквизита</name>
  <enumValues>
    <name>ПФ</name>
  </enumValues>
  <enumValues>
    <name>ГП</name>
  </enumValues>
</mdclass:Enum>

UNF_KlK.КИТ_ДОК/src/Catalogs/Пакеты/Пакеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пакеты</name>
  <attributes>
    <name>ДатаПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.СменыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Стандарт</name>
    <type>
      <types>CatalogRef.Стандарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Толщина</name>
    <type>
      <types>CatalogRef.Толщины</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>CatalogRef.Ширины</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДосок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияНоменклатуры</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Учетчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПакета</name>
    <type>
      <types>EnumRef.ВидыПакетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Несертифицированный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

UNF_KlK.КИТ_ДОК/src/Documents/ОтчетПроизводстваЗаСменуЛСП/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого ТекСтрокаДанные Из ТекущийОбъект.Выпуск Цикл
			Если Не ЗначениеЗаполнено(ТекСтрокаДанные.ХарактеристикаНоменклатуры) Тогда
				ТекСтрокаДанные.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиПиломатериалов(ТекСтрокаДанные.Стандарт.Порода,ТекСтрокаДанные.Толщина,ТекСтрокаДанные.Ширина,ТекСтрокаДанные.Стандарт.Сорт,ТекСтрокаДанные.Длина,ТекСтрокаДанные.Влажность,ТекСтрокаДанные.Номенклатура,Отказ);
			КонецЕсли;		
		КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СырьеКоличествоДосокПриИзменении(Элемент)
	ТекДанные = Элементы.Сырье.ТекущиеДанные;
	ТекДанные.ОбъемДосок = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры

&НаКлиенте
Процедура ВыпускКоличествоДосокПриИзменении(Элемент)
	ТекДанные = Элементы.Выпуск.ТекущиеДанные;
	ТекДанные.Объем = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры

&НаКлиенте
Процедура ВыпускДлинаПриИзменении(Элемент)
	ТекДанные = Элементы.Выпуск.ТекущиеДанные;
	ТекДанные.Объем = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры

&НаКлиенте
Процедура ВыпускШиринаПриИзменении(Элемент)
	ТекДанные = Элементы.Выпуск.ТекущиеДанные;
	ТекДанные.Объем = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры

&НаКлиенте
Процедура ВыпускТолщинаПриИзменении(Элемент)
	ТекДанные = Элементы.Выпуск.ТекущиеДанные;
	ТекДанные.Объем = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры

&НаКлиенте
Процедура СырьеДлинаПриИзменении(Элемент)
	ТекДанные = Элементы.Сырье.ТекущиеДанные;
	ТекДанные.ОбъемДосок = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры


&НаКлиенте
Процедура СырьеШиринаПриИзменении(Элемент)
	ТекДанные = Элементы.Сырье.ТекущиеДанные;
	ТекДанные.ОбъемДосок = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры


&НаКлиенте
Процедура СырьеТолщинаПриИзменении(Элемент)
	ТекДанные = Элементы.Сырье.ТекущиеДанные;
	ТекДанные.ОбъемДосок = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(ТекДанные.КоличествоДосок, ТекДанные.Толщина, ТекДанные.Ширина, ТекДанные.Длина);

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СостояниеПакетаСрезПоследних.Состояние, ЗНАЧЕНИЕ(перечисление.СостоянияПакетов.НеОприходован)) КАК
		|		СостояниеПакета,
		|	СправочникПакеты.Ссылка КАК Пакет
		|ИЗ
		|	Справочник.Пакеты КАК СправочникПакеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеПакета.СрезПоследних(&Дата,) КАК СостояниеПакетаСрезПоследних
		|		ПО СправочникПакеты.Ссылка = СостояниеПакетаСрезПоследних.Пакет
		|ГДЕ
		|	ЕСТЬNULL(СостояниеПакетаСрезПоследних.Состояние,
		|		ЗНАЧЕНИЕ(перечисление.СостоянияПакетов.НеОприходован)) = ЗНАЧЕНИЕ(перечисление.СостоянияПакетов.НеОприходован)
		|	И СправочникПакеты.ДатаПакета МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СправочникПакеты.Смена = &Смена";
	
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТаб = Объект.Выпуск.Добавить();
		СтрокаТаб.Пакет = ВыборкаДетальныеЗаписи.Пакет;
		СтруктураДанныхПакета = КИТ_РаботаСДаннымиСервер.ДанныеПакета(СтрокаТаб.Пакет);
		ЗаполнитьЗначенияСвойств(СтрокаТаб, СтруктураДанныхПакета);

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВозвратныеОтходыЦенаПриИзменении(Элемент)
	ПересчитатьСуммуВозвратныеОтходы();
КонецПроцедуры

&НаКлиенте
Процедура ВыпускПакетПриИзменении(Элемент)
	ТекДанные = Элементы.Выпуск.ТекущиеДанные;
	СтруктураДанныхПакета = КИТ_РаботаСДаннымиКлиент.ПолучитьДанныеПакета(ТекДанные.Пакет);
	ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураДанныхПакета);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпускСтандартПриИзменении(Элемент)
	ТекДанные = Элементы.Выпуск.ТекущиеДанные;
	
	ТекДанные.Номенклатура = ПолучитьНомеклатуру(ТекДанные.Стандарт);
КонецПроцедуры

&НаСервере
Функция ПолучитьНомеклатуру(Стандарт)

	Возврат Стандарт.Номенклатура;

КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПВХ_Влажность = Константы.СвойствоДляВлажности.Получить();
	ВидДляПараметров = Перечисления.ВидыРеквизита.ГП;
	ПВХ_Порода = Константы.СвойствоДляПородПЛ.Получить();
	ПВХ_Сорт = Константы.СвойствоДляСортов.Получить();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратныеОтходыКоличествоПриИзменении(Элемент)
	
	ПересчитатьСуммуВозвратныеОтходы();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуВозвратныеОтходы()

	ТекДанные = Элементы.ВозвратныеОтходы.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;

КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
